In this new section - Data selection, we will learn about advanced techniques of data selection with pandas, how to select a subset of data, how to select multiple rows and columns from a dataset, how to do sorting on a pandas DataFrame or a series, how to filter roles of a pandas DataFrame and also learn how to apply multiple filters to a pandas DataFrame. We will also loook at how to use the axis parameter in pandas and the uses of string methods in pandas. Finally we will learn how to change the datatype of a pandas series.

We will be suing a real dataset from zillow.com, an online real estate marketplace that releases house price datasets as part of their research effort.

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [2]:
%cd /content/drive/My Drive/Colab Notebooks

/content/drive/My Drive/Colab Notebooks

In [3]:
# We will import the pandas modules
import pandas as pd

We will then read in our dataset. Since it is a CSV file, we will be using a pandas'read_csv method for this. We will pass the file name with a comma as a separator to the read_csv method and we will create a DataFrame out of this data which we name data

In [4]:
data= pd.read_csv('data-zillow.csv', sep=',')
data.head()

         Date  RegionID    RegionName  ...        County SizeRank    Zhvi
0  2017-05-31      6181      New York  ...        Queens        0  672400
1  2017-05-31     12447   Los Angeles  ...   Los Angeles        1  629900
2  2017-05-31     17426       Chicago  ...          Cook        2  222700
3  2017-05-31     13271  Philadelphia  ...  Philadelphia        3  137300
4  2017-05-31     40326       Phoenix  ...      Maricopa        4  211300

[5 rows x 8 columns]

The DataFrame is created and we did read a few records from the dataset by performing the data.head() method on the DataFrame. This will give the output with columns, such as Date, and some location fields, such as RegionName, State, Metro and Country. The last column title Zhvi is a Zillow term and is the mean house price of that particular region.

**Sorting a pandas DataFrame**

In this video we will learn about the pandas sort_values method. We will also use various methods to sort a pandas DataFrame and learn how to sort a pandas series object.

Now let's start with the simple type of sorting. We will use pandas's sort_values method for this. For example, imagine that we want to sort the data by the Metro column. We need to pass Metro as a parameter to the sort_values emthod and call the method on the DataFrame.

In [5]:
data.sort_values('Metro')

             Date  RegionID    RegionName  ...        County SizeRank    Zhvi
9851   2017-05-31     48458      Westport  ...  Grays Harbor     9851  144600
4996   2017-05-31     36873          Elma  ...  Grays Harbor     4996  175200
5090   2017-05-31     35514       Hoquiam  ...  Grays Harbor     5090   95700
9401   2017-05-31     33215  Ocean Shores  ...  Grays Harbor     9401  152400
9149   2017-05-31     18370      Grayland  ...  Grays Harbor     9149  143900
...           ...       ...           ...  ...           ...      ...     ...
10764  2017-05-31     35349        Fraser  ...         Grand    10764  274500
10768  2017-05-31     17816       Dresser  ...          Polk    10768  189900
10774  2017-05-31     34232      Tamworth  ...       Carroll    10774  164100
10822  2017-05-31     18317     Goldsboro  ...      Caroline    10822  175700
10825  2017-05-31     26077       Nehalem  ...     Tillamook    10825  392200

[10830 rows x 8 columns]

If you notice , by default the Date column is sorted in ascending order. We can chnage the sorting order, giving the ascending parameter the value of False.

In [6]:
sorted = data.sort_values('Metro', ascending=False)

The ascending parameter is optional, and when not passed, it is set to True by default. Now we will look into how to sort data by more than 1 column. To do this we need to pass the list of columns, by which we want our data to be sorted, to the parameter column of the sort_values method.

In [9]:
sorted = data.sort_values(by=['Metro', 'County'])
sorted.head()

            Date  RegionID RegionName  ...        County SizeRank    Zhvi
2073  2017-05-31     30116   Aberdeen  ...  Grays Harbor     2073  127800
4568  2017-05-31     56078  Montesano  ...  Grays Harbor     4568  182000
4996  2017-05-31     36873       Elma  ...  Grays Harbor     4996  175200
5090  2017-05-31     35514    Hoquiam  ...  Grays Harbor     5090   95700
7108  2017-05-31      6275   Oakville  ...  Grays Harbor     7108  186900

[5 rows x 8 columns]

The data has now been sorted by Metro first and then County column, that is in the same order that we passed them into the sort_values method. We can take the multiple column sort further, and introduce a mixed ascending order. For example, we can sort by 3 columns: Metro, County and the Price column.

In [10]:
sorted = data.sort_values(by=['Metro', 'County', 'Zhvi'], ascending=[True, True, False])
sorted.head()

            Date  RegionID    RegionName  ...        County SizeRank    Zhvi
7108  2017-05-31      6275      Oakville  ...  Grays Harbor     7108  186900
4568  2017-05-31     56078     Montesano  ...  Grays Harbor     4568  182000
4996  2017-05-31     36873          Elma  ...  Grays Harbor     4996  175200
8420  2017-05-31     19269      McCleary  ...  Grays Harbor     8420  170700
9401  2017-05-31     33215  Ocean Shores  ...  Grays Harbor     9401  152400

[5 rows x 8 columns]

You must have noticed that we are passing a list of 3 Boolean values in ascending parameter. This sets the sort order to ascending for Metro, and County and descending fot the last column which is Zhvi.

Next we will see how to sort a series object. First, let's create a series. Let's select the RegionID column from our dataset and create a series.

In [11]:
regions= data.RegionID
type(regions)

pandas.core.series.Series

In [12]:
# Now let;s look that the original series by using regions.head()
regions.head()

0     6181
1    12447
2    17426
3    13271
4    40326
Name: RegionID, dtype: int64

Now let's sort it by calling the sort_values method on it. Since the dataset contains only 1 column, we do not need to pass any column name. Hence, the code to sort the data would be regions.sort_values().head().

In [13]:
regions.sort_values().head()

3043    3301
4159    3304
4986    3305
1762    3310
3116    3312
Name: RegionID, dtype: int64

**Filtering rows of a pandas DataFrame**

In this video, we will learn about methods for filtering rows and columns from a pandas DataFrame, we will introduce a couple of ways to accomplish this. We will also leran about pandas' filter method, and how to use it on our real dataset, as well as ways to protect data based on a Boolean series that we will create from our data. We will also learn how to pass the conditions directly to the DataFrame for filerting the data.


First we will explore the pandas'filter method for filtering data. We can filter columns using filter method. To do this we need to pass columns as a list to the filter method's items parameter.

In [14]:
filtered_data = data.filter(items=['State', 'Metro'])
filtered_data.head()

  State                           Metro
0    NY                        New York
1    CA  Los Angeles-Long Beach-Anaheim
2    IL                         Chicago
3    PA                    Philadelphia
4    AZ                         Phoenix

As you can see from the above result, we did filter columns by State and Metro and created a new DataFrame with the values from the filter columns. We then display the filter data using the head method. Next we will use the filter method to filter columns names using regular expressions. This is done by passing our regular expression to the regex parameter.

In [15]:
filtered_data = data.filter(regex='Region', axis=1)
filtered_data.head()

   RegionID    RegionName
0      6181      New York
1     12447   Los Angeles
2     17426       Chicago
3     13271  Philadelphia
4     40326       Phoenix

The filter method is not the only way to filter data. To filter rows, we can use some interesting techniques. First we will create a series of Boolean values. The Boolean value series is based on the price value column from our dataset. We are choosing to select rows that have lues of more than 500000

In [16]:
price_filter_series = data['Zhvi'] > 500000
price_filter_series.head()

0     True
1     True
2    False
3    False
4    False
Name: Zhvi, dtype: bool

The True values are those that match our condition, that is they stand for rows where the price is higher than 500000. Next we will use this Boolen series to filter the rows from our complete dataset, and get only those values that have a price higher than 500000. To do this we will pass the Boolena series to the dataset DataFrame in square brackets.

In [17]:
data[price_filter_series].head()

          Date  RegionID     RegionName  ...         County SizeRank     Zhvi
0   2017-05-31      6181       New York  ...         Queens        0   672400
1   2017-05-31     12447    Los Angeles  ...    Los Angeles        1   629900
6   2017-05-31     54296      San Diego  ...      San Diego        6   572100
8   2017-05-31     33839       San Jose  ...    Santa Clara        8   877400
10  2017-05-31     20330  San Francisco  ...  San Francisco       10  1194300

[5 rows x 8 columns]

The other way to filter a dataset without explicitly creating a Boolena series is by passing the condition for the values we want to the DataFrame directly. For example, imagine that we want to filter and select only rows where the house price is higher than or equal to 100000.

In [18]:
data[data.Zhvi >= 100000].head()

         Date  RegionID    RegionName  ...        County SizeRank    Zhvi
0  2017-05-31      6181      New York  ...        Queens        0  672400
1  2017-05-31     12447   Los Angeles  ...   Los Angeles        1  629900
2  2017-05-31     17426       Chicago  ...          Cook        2  222700
3  2017-05-31     13271  Philadelphia  ...  Philadelphia        3  137300
4  2017-05-31     40326       Phoenix  ...      Maricopa        4  211300

[5 rows x 8 columns]